package kr.hs.sdh.fitbit.fitbitandroidgame;

/**
 * Created by Resten on 2018-02-15.
 */

public class question {

    public String mQuestion[]={
    "햇볕 아래 있는 시간을 늘리고, 우리몸에서 비타민D이 합성되면 우울증을 극복하는데 도움이 된다?",
    "매일 마시더라도 맥주 한 캔정도는 괜찮다?",
            "금연을 위해서는 오늘부터 조금 씩 줄여가가는 것이 좋다?",
            "당뇨는 약물을 잘 챙겨 먹는다면 단기간에도 완치 가능하다?",
            "걷기는 적어도 30분 이상은 걸어야 운동 효과를 볼 수 있다?",
            "운동의 강도는 최대 심장 박동수의 50~60%를 유지하는 것이 좋다?",
            "운동은 무리하더라도 하는 것이 안하는 것 보다 좋다?",
            "근력운동은 매일(적어도 주 5회) 하여야 효과가 있다?",
            "운동은 밤에 하는 것이 수면에 도움이 된다?",
            "춘곤증은 겨울 내 줄었던 신진대사가 활발해지면서 생기는 피로 증상이다?"
    };

    public String mAnswer[] = {
            "우울증에 좋은 비타민D: 연어, 우유, 달걀노른자, 생선, 간 등을 섭취하면 부족한 부족한 비타민D를 섭취할 수 있어서 너무 좋아요!!~",

            "매일 밤마다 술을 마시게 되면 잠에 잘 못 드는 습관이 생길 수 있어요. 오늘 밤엔 맥주 한 캔 대신 따뜻한 허브티 한잔 어떠세요? :)",

            "•성공적인 금연 요령\n" +
                    "①준비 단계: 가능한 의미 있는 날을 금연 시작일로 정하고, 주위의 친구와 가족에게 금연 계획을 알리고 도움을 청하세요.\n" +
                    "②실시 단계: 단숨에 끊는 것이 가장 효과적입니다. 금단 증상은 수일에서 수주가 지나면 벗어날 수 있습니다. \n" +
                    "③유지 단계: 흡연 유혹이 생기는 술자리와 같은 상황을 적극적으로 피합니다.",

            "•당뇨병이란: 혈액 속의 포도당을 세포로 이동시켜 혈액의 혈당량을 낮추어 주는 인슐린의 부족으로 탄수화물 대사에 이상이 생기는 질환을 말합니다. \n" +
                    "•원인: 체중 증가, 과식, 운동 부족, 스트레스, 연령 \n" +
                    "•치료 및 예방: 하나의 약물로 단기간에 완치가 되지는 않아요. 하지만 철저한 혈당 관리(식이요법, 운동요법, 약물)를 한다면 합병증 발병률을 낮출 수 있어요. ",

            "•당신의 삶에 활력을 되찾아 주는 추천 운동 3가지\n" +
                    "①걷기: 걷기는 시간이 중요해요. 적어도 30분 이상은 걸어야 운동 효과를 볼 수 있어요.\n" +
                    "②수영: 운동 강도가 높지 않으면서도 심혈관계를 효과적으로 자극할 수 있어 좋아요. 수중 체조나 그냥 물속에서 걷기만 해도 굿!\n" +
                    "③자전거: 관절이 약한 사람도 크게 무리가 되지 않아요. 다만 힘들여서 페달을 밟으면 혈압이 높아질 수 있으니 고혈압이 있으신 분들은 무리하지 마세요.\n",

            "•운동 강도 바로 알기\n" +
                    "①심장박동수\n" +
                    "최대 심장박동수의 50~60%를 유지\n" +
                    "②운동 중 최적의 맥박수\n" +
                    "=(220 - 본인 나이) ⅹ 0.5~ 0.6\n",

            "•운동 강도 체크 방법\n" +
                    "①전체 강도를 1~20으로 볼 때13~15로 ‘약간 힘들다’라고 느끼는 정도의 강도가 이상적!\n" +
                    "②보통 운동 중 옆 사람과 대화가 가능하고 몸에 약간 땀이 날 정도면 적당!\n" +
                    "③운동은 무리하면 안 하는 것만 못하다는 사실 잊지 마세요~",

            "•운동 종류와 빈도\n" +
                    "①심폐 지구력 운동: 걷기, 자전거, 달리기, 수영, 물속 걷기로 가급적 매일 하는 것이 좋아요.\n" +
                    "②근력 운동: 머신, 프리웨이트, 밴드 등 순환식 근력 운동은 주 2~3회가 적당해요.\n" +
                    "\n" +
                    "•운동 시간: 운동 1회마다 30~60분 가량 진행하되, 힘들다면 10분씩 나눠서 여러 차례 하는 것도 방법이에요",

            "•건강한 수면 8계명\n" +
                    "①운동은 밤보다 낮에!\n" +
                    "②잠자리는 안락하게 하고 낮잠은 15분 이내로!\n" +
                    "③카페인, 알코올은 NO!\n" +
                    "④잠자고 일어나는 시간을 규칙적으로!\n",

            "•봄철 운동 방법: 겨울에 움츠러들었던 근육은 갑작스럽게 활동하면 무리가 될 수 있어요. 과격한 운동보다는 맨손체조나 스트레칭으로 몸을 풀어주는 게 좋아요 : ) \n" +
                    "•봄철 추천 음식: 피로 회복에 필요한 비타민 C와 비타민 B가 많이 들어간 음식을 섭취하는 것이 무엇보다 중요해요. 딸기, 키위, 바나나 등의 과일과 냉이와 쑥 같은 봄나물을 드셔 보세요! "

    };
 // 1은 정답이고 2는 오답
    public int result_act[] = { 1,2,2,2,1,1,2,2,2,1};
}
